let GeoIPDB_FULL = _GetWatchlist("geoip");

let WindowsEvents =
SecurityEvent
| where EventID == 4625
| evaluate ipv4_lookup(GeoIPDB_FULL, IpAddress, network);

WindowsEvents
| project
    TimeGenerated,
    Account,
    IpAddress,
    Country = countryname,
    City = cityname,
    Latitude = latitude,
    Longitude = longitude

Joins the SecurityEvent table with the GeoIP Watchlist to enrich attacker IP addresses with geographic information.

This enables Microsoft Sentinel Workbooks to visualize attacker locations on an interactive world map.
